package Seminar6.HW6;

// Определить класс Reader, хранящий такую информацию о пользователе библиотеки:
// 1. ФИО,
// 2. номер читательского билета,
// 3. факультет,
// 4. дата рождения,
// 5. телефон.
// 6. Методы (экземпляра, без слова static) takeBook(), returnBook().
// 7. Разработать программу, в которой создается массив объектов данного класса.
// 8. Перегрузить методы takeBook(), returnBook():
//    - takeBook, который будет принимать количество взятых книг.
//      Выводит на консоль сообщение "Петров В. В. взял 3 книги".
//    - takeBook, который будет принимать переменное количество названий книг.
//      Выводит на консоль сообщение "Петров В. В. взял книги: Приключения, Словарь, Энциклопедия".
//    - takeBook, который будет принимать переменное количество (Тип... parameterName)
//      объектов класса Book (создать новый класс, содержащий имя и автора книги).
//      Выводит на консоль сообщение "Петров В. В. взял книги: Приключения, Словарь, Энциклопедия".
// 9. Аналогичным образом перегрузить метод returnBook().
//    Выводит на консоль сообщение "Петров В. В. вернул книги: Приключения, Словарь, Энциклопедия".
//    Или  "Петров В. В. вернул 3 книги".

public class CreateObjects {
    public static void main(String[] args) {
        Reader reader1 = new Reader("Петр", "Петров", "Петрович", 125,
                "Прикладная математика", "16.02.1999", "100");
        Reader reader2 = new Reader("Иван", "Иванов", "Иванович", 981,
                "Информационная безопасность", "28.06.2002", "200");
        Reader reader3 = new Reader("Максим", "Белов", "Сергеевич", 523,
                "Прикладная математика", "02.11.2000", "300");

        System.out.println("=================================================");
        System.out.println(reader1);
        System.out.println(reader2);
        System.out.println(reader3);
        System.out.println("=================================================");

        System.out.println();

        Book book1 = new Book("Введение в прикладное дискретное программирование", "Александра Иванова");
        Book book2 = new Book("Теория графов", "Александр Омельченко");
        Book book3 = new Book("Совершенный код. Мастер-класс", "Стив Макконнелл");

        System.out.println("=================================================");
        System.out.println(book1);
        System.out.println(book2);
        System.out.println(book3);
        System.out.println("=================================================");

        System.out.println();

        System.out.println("**************************************************");
        reader1.takeBook();
        reader2.takeBook(3);
        reader3.takeBook("Словарь", "Энциклопедия", "Приключения");

        Book[] booksNames = new Book[]{book1, book2, book3};
        reader1.takeBook(booksNames);
        System.out.println("**************************************************");

        System.out.println();

        System.out.println("**************************************************");
        reader1.returnBook();
        reader2.returnBook(1);
        reader3.returnBook("Словарь", "Приключения");
        reader1.returnBook(book1, book3);
        System.out.println("**************************************************");
    }
}
